Repository: RYLN507/DSI202_2025
Catalog: imsukproject/myproject/locale/*/LC_MESSAGES/django.po
Languages: th

source: Edit Address
th: แก้ไขที่อยู่

source: Address Name
th: ชื่อที่อยู่

source: Full Address
th: ที่อยู่จัดส่ง

source: Subdistrict
th: ตำบล

source: District
th: อำเภอ

source: Province
th: จังหวัด

source: Postal Code
th: รหัสไปรษณีย์

source: Set as default address
th: ตั้งเป็นที่อยู่เริ่มต้น

source: Save
th: บันทึก

source: Back to Address List
th: กลับสู่หน้าที่อยู่

source: My Addresses
th: ที่อยู่ของฉัน

source: No address name
th: ไม่มีชื่อที่อยู่

source: Default Address
th: ที่อยู่เริ่มต้น

source: Set as default
th: ตั้งเป็นที่อยู่เริ่มต้น

source: Delete
th: ลบวิธีชำระเงิน

source: You have no addresses saved.
th: คุณยังไม่มีที่อยู่จัดส่ง

source: Add New Address
th: เพิ่มที่อยู่ใหม่

source: Care
th: ใส่ใจ

source: Sharing
th: แบ่งปัน

source: Understanding in every meal
th: เข้าใจในทุกมื้ออาหาร

source: My Cart
th: ตะกร้าของฉัน

source: No Image
th: ไม่มีรูปภาพ

source: Subtotal
th: ราคารวม

source: Delivery Fee
th: ค่าส่ง

source: Grand Total
th: ราคารวมทั้งหมด

source: Proceed to Checkout
th: ชำระเงิน

source: Your cart is empty.
th: คุณยังไม่มีอาหารในตะกร้าของคุณ

source: Start Ordering
th: เริ่มสั่งอาหาร

source: Checkout
th: ชำระเงิน

source: Confirm Your Order
th: ยืนยันการชำระเงิน

source: Shipping Address
th: ที่อยู่จัดส่ง

source: You don't have a shipping address yet.
th: คุณยังไม่มีที่อยู่จัดส่ง

source: Change Address
th: เปลี่ยนที่อยู่

source: Your Menu
th: เมนูของคุณ

source: Additional Options
th: ตัวเลือกเพิ่มเติม

source: I want plastic utensils
th: ฉันต้องการช้อนส้อมพลาสติก

source: I want sauce/condiments (if available)
th: ฉันต้องการซอส

source: Payment Method
th: วิธีการชำระเงิน

source: Pay with VISA
th: ชำระเงินโดย VISA

source: Place Order
th: ยืนยันคำสั่งซื้อ

source: IMSUK
th: อิ่มสุข

source: Order
th: คำสั่งซื้อ

source: Quantity
th: จำนวน

source: pcs
th: ชิ้น

source: Total Amount
th: ยอดรวมทั้งหมด

source: Confirm Payment
th: ยืนยันการชำระเงิน

source: Order not found.
th: ไม่พบคำสั่งซื้อนี้

source: Back to Order History
th: กลับไปยังประวัติคำสั่งซื้

source: Reconfirm Order
th: ยืนยันการสั่งซ้ำ

source: Cancel
th: ยกเลิก

source: Confirm Reorder
th: ยืนยันการสั่งซ้ำ

source: Dinner Deals
th: ดีลอาหารมื้อเย็น

source: Back to Home
th: ดูรายละเอียดเมนู

source: Special Deal
th: ยังไม่มีดีลอาหารมื้อเย็นในขณะนี้

source: View Menu Details
th: ดูรายละเอียดเมนู

source: No dinner deals available at the moment.
th: ยังไม่มีดีลอาหารมื้อเย็นในขณะนี้

source: No image available
th: ไม่มีรูปภาพ

source: Sold:
th: ขายแล้ว:

source: items
th: รายการ

source: Available time:
th: เวลาที่เปิดให้บริการ:

source: What you'll get
th: สิ่งที่คุณจะได้รับ

source: Menu Details
th: รายละเอียดเมนู

source: Add to Cart
th: เพิ่มลงในตะกร้า

source: Add to Favorites
th: เพิ่มในรายการโปรด

source: Favorite Restaurants & Menus
th: ร้านอาหารและเมนูโปรด

source: My Favorite Restaurants
th: ร้านอาหารโปรดของฉัน

source: View Restaurant
th: ดูร้านอาหาร

source: You don't have any favorite restaurants yet.
th: คุณยังไม่มีร้านอาหารโปรด

source: My Favorite Menus
th: เมนูโปรดของฉัน

source: View Menu
th: ดูเมนู

source: You don't have any favorite menus yet.
th: คุณยังไม่มีเมนูโปรด

source: Product Filter
th: ตัวกรองเมนู

source: Filters
th: ตัวกรอง

source: Close
th: ปิด

source: Only show menus available now
th: แสดงเฉพาะเมนูที่สั่งได้ตอนนี้

source: Food Categories
th: หมวดหมู่อาหาร

source: Allergy Filters
th: ตัวกรองอาการแพ้อาหาร

source: Milk
th: นม

source: Egg
th: ไข่

source: Peanut
th: ถั่วลิสง

source: Gluten
th: กลูเตน

source: Seafood
th: อาหารทะเล

source: Fish
th: ปลา

source: Price Range
th: ช่วงราคา

source: Low (≤100)
th: ต่ำ (≤100 บาท)

source: High (>500)
th: สูง (>500 บาท)

source: Apply Filters
th: ใช้ตัวกรอง

source: Reset All
th: รีเซ็ตทั้งหมด

source: Medium (101–500)
th: ปานกลาง (101–500 บาท)

source: Choose Price Range
th: เลือกช่วงราคา

source: Filtered Results
th: ผลลัพธ์ที่กรองแล้ว

source: Found %(count)s items
th: พบ %(count)s รายการ

source: Results from Applied Filters
th: ผลลัพธ์จากตัวกรองที่เลือก

source: No description available
th: ไม่มีคำอธิบาย

source: View Details
th: ดูรายละเอียด

source: No menus matched your filters 😢
th: ไม่มีเมนูที่ตรงกับตัวกรองของคุณ 😢

source: Adjust Filters
th: ปรับตัวกรอง

source: All Flash Deal Menus
th: เมนูนาทีทองทั้งหมด

source: Discount
th: ส่วนลด

source: No flash deals available at the moment
th: ยังไม่มีเมนูนาทีทองในขณะนี้

source: Flash Deal Menu
th: เมนูนาทีทอง

source: Back to Flash Deals
th: กลับไปยังเมนูนาทีทอง

source: No Image Available
th: ไม่มีรูปภาพ

source: Available from
th: สั่งได้ตั้งแต่เวลา

source: Menu Description
th: คำอธิบายเมนู

source: No related menu found
th: ไม่พบเมนูที่เกี่ยวข้อง

source: Help Center
th: ศูนย์ช่วยเหลือ

source: If you have questions or issues using IMSUK, please refer to the information below or contact us at:
th: หากคุณมีคำถามหรือพบปัญหาในการใช้งาน IMSUK กรุณาอ่านข้อมูลด้านล่างหรือติดต่อเราที่:

source: Email
th: อีเมล

source: Phone
th: โทรศัพท์

source: Frequently Asked Questions (FAQ)
th: คำถามที่พบบ่อย (FAQ)

source: How can I change my delivery address?
th: ฉันสามารถเปลี่ยนที่อยู่จัดส่งได้อย่างไร?

source: Go to
th: ไปที่

source: and choose 'Edit' or 'Add New' to update your delivery address.
th: และเลือก 'แก้ไข' หรือ 'เพิ่มใหม่' เพื่ออัปเดตที่อยู่จัดส่งของคุณ

source: Where can I view my order history?
th: ฉันสามารถดูประวัติการสั่งซื้อของฉันได้ที่ไหน?

source: Order History
th: ประวัติการสั่งซื้อ

source: to view all your past orders.
th: เพื่อดูคำสั่งซื้อทั้งหมดของคุณในอดีต

source: How can I contact the restaurant?
th: ฉันสามารถติดต่อร้านอาหารได้อย่างไร?

source: At the
th: ที่หน้า

source: Restaurant Detail Page
th: รายละเอียดร้านอาหาร

source: you will find contact info at the bottom.
th: คุณจะพบข้อมูลการติดต่อที่ด้านล่างของหน้า

source: Home
th: หน้าแรก

source: Restaurants
th: ร้านอาหาร

source: View All
th: ดูทั้งหมด

source: Login
th: เข้าสู่ระบบ

source: Sign In
th: ลงชื่อเข้าใช้

source: Password
th: รหัสผ่าน

source: Forgot password?
th: ลืมรหัสผ่าน?

source: No description available for this menu.
th: ไม่มีคำอธิบายสำหรับเมนูนี้

source: Available Time
th: เวลาจำหน่าย

source: Please log in to place an order.
th: กรุณาเข้าสู่ระบบเพื่อสั่งอาหาร

source: My Order History
th: ประวัติการสั่งซื้อของฉัน

source: Total
th: รวม

source: Paid
th: ชำระแล้ว

source: Unpaid
th: ยังไม่ชำระ

source: Order Again
th: สั่งอีกครั้ง

source: You have no order history yet.
th: คุณยังไม่มีประวัติการสั่งซื้อ

source: Start Ordering Now
th: เริ่มสั่งอาหารตอนนี้

source: Order Successful
th: สั่งซื้อสำเร็จ

source: Thank you for your order!
th: ขอบคุณสำหรับการสั่งซื้อ!

source: Your order has been successfully recorded.
th: คำสั่งซื้อของคุณถูกบันทึกเรียบร้อยแล้ว

source: Return to Homepage
th: กลับไปหน้าแรก

source: Password Changed Successfully
th: เปลี่ยนรหัสผ่านเรียบร้อยแล้ว

source: Your password has been changed!
th: รหัสผ่านของคุณถูกเปลี่ยนแล้ว!

source: Your new password has been saved successfully.
th: รหัสผ่านใหม่ของคุณถูกบันทึกเรียบร้อยแล้ว

source: Please use the new password the next time you log in.
th: กรุณาใช้รหัสผ่านใหม่นี้ในการเข้าสู่ระบบครั้งถัดไป

source: Back to Profile
th: กลับไปที่โปรไฟล์

source: Change Password
th: เปลี่ยนรหัสผ่าน

source: Please check your input.
th: กรุณาตรวจสอบข้อมูลของคุณ

source: Old Password
th: รหัสผ่านเดิม

source: New Password
th: รหัสผ่านใหม่

source: Confirm New Password
th: ยืนยันรหัสผ่านใหม่

source: Confirm Password Change
th: ยืนยันการเปลี่ยนรหัสผ่าน

source: Add New Payment Method
th: เพิ่มวิธีชำระเงินใหม่

source: Payment method added successfully!
th: เพิ่มวิธีชำระเงินเรียบร้อยแล้ว!

source: Card/Account Name
th: ชื่อบัตร/บัญชี

source: Details (e.g., account number)
th: รายละเอียด (เช่น หมายเลขบัญชี)

source: Add Payment Method
th: เพิ่มวิธีชำระเงิน

source: Back to Payment Methods
th: กลับไปยังวิธีชำระเงิน

source: Confirm Delete Payment Method
th: ยืนยันการลบวิธีชำระเงิน

source: Delete Payment Method
th: ลบวิธีชำระเงิน

source: Are you sure you want to delete this payment method?
th: คุณแน่ใจหรือไม่ว่าต้องการลบวิธีชำระเงินนี้?

source: Confirm Deletion
th: ยืนยันการลบ

source: Are you sure you want to delete the payment method
th: คุณแน่ใจหรือไม่ว่าต้องการลบวิธีชำระเงินนี้

source: Delete this payment method
th: ลบวิธีชำระเงินนี้

source: Cancel and go back to the list
th: ยกเลิกและกลับไปยังรายการ

source: Edit Payment Method
th: แก้ไขวิธีชำระเงิน

source: Payment method updated successfully!
th: อัปเดตวิธีชำระเงินเรียบร้อยแล้ว!

source: Details
th: รายละเอียด

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: My Payment Methods
th: วิธีชำระเงินของฉัน

source: Edit
th: แก้ไข

source: You don't have any payment methods yet.
th: คุณยังไม่มีวิธีชำระเงิน

source: My Profile
th: โปรไฟล์ของฉัน

source: Profile Picture
th: รูปโปรไฟล์

source: Choose Profile Picture
th: เลือกรูปโปรไฟล์

source: Upload
th: อัปโหลด

source: Remove
th: ลบออก

source: No default address set.
th: ยังไม่ได้ตั้งค่าที่อยู่เริ่มต้น

source: Payment Methods
th: วิธีชำระเงิน

source: No payment methods added yet.
th: ยังไม่มีวิธีชำระเงินที่เพิ่มไว้

source: Manage Payment Methods
th: จัดการวิธีชำระเงิน

source: Account Security
th: ความปลอดภัยบัญชี

source: Register
th: ลงทะเบียน

source: Welcome to IMSUK
th: ยินดีต้อนรับสู่ อิ่มสุข

source: First Name
th: ชื่อจริง

source: Last Name
th: นามสกุล

source: Phone Number
th: เบอร์โทรศัพท์

source: Confirm Password
th: ยืนยันรหัสผ่าน

source: Address
th: ที่อยู่

source: Food Allergies (e.g., nuts, milk, gluten)
th: แพ้อาหาร (เช่น ถั่ว นม กลูเตน)

source: I accept the
th: ฉันยอมรับ

source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

source: Already have an account?
th: มีบัญชีอยู่แล้ว?

source: Back to Category:
th: กลับไปยังหมวดหมู่:

source: Menu
th: เมนู

source: This restaurant has no menu items.
th: ร้านอาหารนี้ยังไม่มีเมนู

source: Back to category:
th: กลับไปยังหมวดหมู่:

source: Food Category: %(category.display_name)s
th: หมวดอาหาร: %(category.display_name)s

source: Price
th: ราคา

source: There are no menu items in this category yet.
th: ยังไม่มีเมนูในหมวดหมู่นี้
